
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220437634)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
pagerduty_team.pd_team["poc"]: Refreshing state... [id=PVFT88T]
data.pagerduty_vendor.vendor: Reading...
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Refreshing state... [id=POCJ4A2]
data.pagerduty_vendor.vendor: Read complete after 0s [id=PAM4FGS]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"]: Refreshing state... [id=POCJ4A2:PVFT88T]
data.pagerduty_users.pd_users["poc-system"]: Reading...
data.pagerduty_users.pd_users["poc-system"]: Read complete after 0s [id=1710056116]
pagerduty_escalation_policy.pd_esp["poc-system"]: Refreshing state... [id=PD6MH3X]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pagerduty_service.pd_service["poc-system"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = "PD6MH3X"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Poc-System"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service_integration.datadog["poc-system"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-system"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
pagerduty_service.pd_service["poc-system"]: Creating...
pagerduty_service.pd_service["poc-system"]: Creation complete after 0s [id=PZQGPHK]
pagerduty_service_integration.datadog["poc-system"]: Creating...
pagerduty_service_integration.datadog["poc-system"]: Creation complete after 1s [id=PR24E6U]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"81bc44eed0d729ec9f950b3392482d7093850041","Vars":{},"WorkflowName":"Plan"} -->